yii3/backend/controllers/CarController.php

    public function actionTest(){
        $request=Yii::$app->request->post();
        // // echo '<pre>';print_r($request);die;
        // // $request=Yii::$app->request->get();
        $tem=User::find()->where(['username' => $request['temp']])->one();
---
SELECT * FROM `user` WHERE `username`='kulshreshtha'