yii3/frontend/controllers/CarController.php

    protected function findModel($id)
    {
        if (($model = Carloan::findOne($id)) !== null) {
---
SELECT * FROM `carloan` WHERE `id`='47'

    public function actionUppro(){
        $request=Yii::$app->request->get();
        // $model=new User;
        $model=User::find()->where(['username' => $request['user']])->one();
---
SELECT * FROM `user` WHERE `username`='kulshreshtha'